package model.field;

/**
 * Класс Поля. По сути это контейнер объектов, которые могут на нем располагаться.
 * В моей базовой игре, это Корабли Игрока, Корабли Противника.
 * Так же стоит отметить что это класс именно модели, то есть не отвечает за отрисовку объектов на нем.
 * Данный класс в ответе за факт наличия данных объектов на нем, и так же за обработку столкновений объектов.
 * При чем как мне кажется, он даже не обрабатывает их столкновения, а просто фиксирует его.
*/
public class Field {
}
